{
    "posts": [
        {
            "id": "1",
            "metadata": "25/12/2022 · Yuval Aloni\n### A new bank is coming\nIt’s been more than 5 years since Shir Raanan, Alex Liverant and I began our journey and formed esh, and finally, we can now share our first public post, as we officially obtained a bank license today.",
            "content": "25/12/2022 · By Yuval Aloni, Co-Founder & CEO of esh Group\n### A new bank is coming\n##### It’s been more than 5 years since Shir Raanan, Alex Liverant and I began our journey and formed esh, and finally, we can now share our first public post, as we officially obtained a bank license today.\nesh is a for-profit banking technology group. Our goal is to help accelerate the transition from conflicting banking models to mutual-interest banking models. We believe that we can offer better solutions by incorporating the efficiency of platform automation into banking. Two presently known developments are the following ventures: a core banking technology company and a consumer-centric bank brand that applies this technology for the benefit of its customers.\nIt’s hard to imagine a world where consumer products like Gmail, Zoom or WhatsApp are manually operated by clerks and committees, instead of by computer software. That is not a reality we want to live in, so why does it still exist in banking? At esh, instead of using technology to help bankers, our bankers oversee and supervise the constantly evolving autonomous technology for the benefit of our customers.\n#### If you are giving back, you took too much\nThe mindset of traditional banks and banking technology-suppliers is unique and far away from the public eye, and is very much conflicting with customer benefit, so when the bank earns more, customers earn less. This mindset has created distrust towards banks. We have a different mindset.\nIt was literally easier to build the bank that we wanted than trying to convince everyone that we can. We have remained under the radar for the past 5 years and have been operational and live on a small scale as a regulated financial institution since May 2017.\nWith the support of the regulators and a small group of first customers, we have tested our systems and will continue testing and optimizing to ensure that all our systems are bank-grade in all respects, are customer-centric, and emphasize security and solid infrastructure.\n#### esh Bank (in setup)\nAs some of you may know, the initial product of esh is a current bank account called the ‘esh Account’. However, some readers may not be aware of the fact that our long-term plan is to build a range of products, including affordably priced loans.\nWe have designed the bank to be efficient by completely overhauling its cost structure, and the money we save there will come into play, transparently, to the benefit of our customers.\nI can guarantee that there won’t be any account management fees, we won’t ask you to transfer your old bank account or paycheck to your esh Account, and that our next set of products will also include payments and issuance of international payment cards for households and businesses.\n#### esh Operating System (‘EOS’)\nWhen building a cloud-based ‘bank operating system’ platform while also owning the bank itself, we had a unique opportunity to make things dramatically better.\nUnlike traditional banks and neo-banks that are all running on the same legacy core-banking systems with a complex supply chain, the same products, the same integration problems, the same cost structure and the same time-to-market issues, we wanted to build it differently. And we absolutely did not want our bank to become another heartless, soulless ‘integrator’ of similar products that all banks are already offering and that only compete on price.\nWhen developing a full end-to-end autonomous core banking platform, you can dramatically reduce costs and create a financial environment of mutual interest between the bank and its customers, rather than the traditional adversarial environment.\nTo achieve this, at EOS, as a fast-growing technology company, all free cash flow will be plowed back into R&D to drive down the costs and introduce the next line of products quickly. When someone will take a loan within their esh Account, they will actually help pay for the development of the zero-cost esh Card.\nWhen the higher margin that the bank is making due to technology advancement is translated directly to customers, then you get a full range of things you can do to benefit customers without affecting the bank’s bottom line.\nBig thanks and congratulations to our amazing team and partners, special thanks to Nir Zuk and Alon Shine. We have an entire team of incredible people working together behind this, whom we will write about in a separate post.\nAn exciting journey is ahead of us.\nY."
        },
        {
            "id": "2",
            "metadata": "07/01/2023 · By Yuval Aloni\n### esh Welcomes Clal as Shareholders\nClal is expected to invest $30 million and join as a shareholder in esh",
            "content": "07/01/2023 · By Yuval Aloni, Co-Founder & CEO of esh Group\n### esh Welcomes Clal as Shareholders\n##### Clal is expected to invest $30 million and join as a shareholder in esh\nWe are happy to announce that Clal, a reputable financial institution, with a history of successful investments in reliable and market-leading companies, is investing $30 million in esh, granting it ownership of 4.99% of the shares in each of the esh group companies - the bank and the technology company. Upon completion of the investment, the esh group companies will have a valuation of over $500 million.\nThis investment will allow us to develop the product according to our vision and market entry.\nIn a reality where economic transactions are performed automatically, and machine learning keeps developing and challenging traditional models, it demands a new bank operating-system that is most fitting. The unique platform developed by the technology company esh OS, is an alternative to the outdated core system used in banks today, and enables for the first time, a complete end-to-end banking services platform - all bank systems under one modular system. This is not only about a revolutionary technological change, but also a change in perception for all of us - from bankers to customers.\nClal’s decision to join us on this journey is a vote of confidence from a leading institutional investor. We congratulate Clal on joining as shareholders in the group.\nClal will join the existing shareholders, who have so far invested over $30 million. After the deal is completed, the total investment in esh will be over $60 million (Tier 1 equity capital).\nThis is an opportunity to thank and congratulate our existing partners - experienced entrepreneurs and investors of exceptional international stature - from Nir Zuk and Alon Shine, who together with Alex Liverant and I form the control core, to Shmuel Gniwisch, Jose Mugrabi, and many others who are marching together with us.\nY."
        }
    ]
}